DAUoverset-7/tutorials/simpleRotor3D/0.orig/0/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
94488
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    hole
    {
        type            zeroGradient;
    }
    overset2
    {
        type            overset;
        value           uniform 1;
    }
}


// ************************************************************************* //
